"""
Определите, что будет напечатано в результате выполнения программы, записанной ниже на разных языках программирования.
"""

n = 1
s = 0
while n <= 100:
    s = s + 30
    n = n * 2

print(s)

# 210
